kaaproject/sample-apps/common/c/targets/cc32xx/target_gpio_led.c
/**
 *  Copyright 2014-2016 CyberVision, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

#include "target_gpio_led.h"
#include "target.h"

#include "gpio.h"
#include "gpio_if.h"
#include "pin.h"
#include "prcm.h"
#include "hw_memmap.h"
#include "rom_map.h"

void target_gpio_led_init(void) {
    MAP_PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK);
    MAP_PinTypeGPIO(PIN_64, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA1_BASE, 0x2, GPIO_DIR_MODE_OUT);
    MAP_PinTypeGPIO(PIN_01, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT);
    MAP_PinTypeGPIO(PIN_02, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT);
    GPIO_IF_LedConfigure(LED1|LED2|LED3);
    GPIO_IF_LedOff(MCU_ALL_LED_IND);
}

void target_gpio_led_toggle(int id, int status) {
    if(id >= NUM_GPIO_LEDS || id < 0) {
        return;
    }
    if (status) {
        GPIO_IF_LedOn(MCU_RED_LED_GPIO + id);
    } else {
        GPIO_IF_LedOff(MCU_RED_LED_GPIO + id);
    }
}

